/*
مبدئيا كدة 
في التعليق تكتب عادي باي لغة  طول ما محطوطة بين العلامتي دول
مش هيفهم غير المبرمج لو عايز يفكر نفسه بحاجة 
أو انت يا صديقي لانك بقرا تعليقاتي و تفهم معاني العبارات و تتعلم مهارات حلي المتواضعة
😅
و لو مش هتعلق خالص هذا لا يؤثر اطلاقا في عمل الكود او البرنامج
بالتوفيق ليك يا صديقي
*/
#include <iostream>
/*
' # ' == رمز الشباك ده كاني بخاطب الكومبيوتر و بقوله : يا كومبيوتر
"include" == "معناها بالعربي "ضم 
<iostream> == اي حاجة جوا <> هي مكتبة او بصورة ادق هي اوامر برمجية متخزنة جوا هذا الملف 
               و الاوامر دي مسئولة عن تنفيذ مهام معينة واول مكتبة هنرحب بيها هي 
               iostream 
               دي جواها اوامر مسئولة عن ادخال قيم و اظهارها او اخراجها
*/

using namespace std;
/*
using namespace std; // (using): استخدم - (namespace): منطقة أسماء - (std): المكتبة القياسية -> عشان "أختصر" الكود
بدل ما في كل امر برمجي اكتب std :: 
لو مكتبتش النص ده يبقي تتضر تكت كل امر قبله المقطع std
*/

int main()
// int main() // "الريس الكبير"؛ هو ده السطر اللي الكمبيوتر بيدور عليه عشان يبدأ تنفيذ الأوامر بالترتيب و هتفهم اكتر السطر ده معناه ايه لما نحل شيت الدوال
{
  string s; 
  cin >> s;
  cout << "Hello, "<< s;
}
