#include<iostream>
using namespace std;
int main()
// خلاص يا بطل انت فهمت بالملي اول 3 سطور بيعملو ايه في اول شيت
{
  // بعد ما اخدنا التمهيدي ده يعتبر اسهل شيت تحله لانك بتتعرف علي انواع ال داتا تايبس  و هشرحها لك ع السريع برده للتذكرة
  
int a;  // ده اختصار لجملة معناها الاعداد الصحيحة و دي ما تخدش كسور و حتي اذا استخدمت كسور هيطبع لك العدد الصحيح دون تقريييييب عشان تاخد بالك ود استخدمها في اعمار الاشخاص او درجات حرارة او سنين بص ف الحاجات الصغيرة
long long b;// ده اخوه الكبير يعني سعة تخزينية اكبر و ده مثلا تستخدمه في عمليات حسابية طويلة و معقدة او في حساب اقتصاد دولة بص استخدمه في الحاجات الكبيرة int لو فهمت ال  
  
char c; //  بيخزن عنصر رمز علامة رقم ==== لازم يكون حرف واااااااااااااحد 
  
float d; // نفس فكرة الاعداد الصحيحة بس الميزة انه كسر 
double e; // نفس الفكرة لكن  سعة تخزينية اكبر
  
cin >> a >> b >> c >> d >> e  ; // ولازم بالترتيب علي حسب السؤال 
 cout << a <<endl;
 cout << b <<endl;
 cout << c <<endl;
 cout << d <<endl;
 cout << e <<endl;

  // ينفع تكتبها كدة
  // cout << a << endl << b << endl << c << endl << d << endl << e << endl;
  // cout << a << "\n" << b << "\n" << c << "\n" << d << "\n" << e << "\n";
  // اهي دي برشحها عن الاولي لانها اسرع و مختصرة 
}
