// لينك السؤال : https://codeforces.com/group/MWSDmqGsZm/contest/219158/problem/C
#include<iostream>
using namespace std;
int main()
// مش جديدة التلاتة دول كالمعتاد
{
long long X,Y;
cin >> X >> Y;
// السؤال ده بيثبت إن الكمبيوتر وسيلة ذكية بتقدر تستقبل أرقام ضخمة، تعيد ترتيبها، وتجري عليها عمليات حسابية معقدة في لحظة، وتطلعها للمستخدم بشكل منظم ومفهوم
  /*
  1. العمليات الأساسية (kg1)
+ : الجمع (بيزود).

- : الطرح (بينقص).

* : الضرب (النجمة هي العلامة).

/ : القسمة (بيوزع).

% : باقي القسمة (بيقولك "فاضل كام" بعد ما وزعنا).
هنحتاجه ياااامااااا

2. قريبا : علامات "أنجزني" (الاختصارات)
++ : زود "واحد" بس.

-- : نقص "واحد" بس.

+= : زود "قيمة معينة" على اللي موجود.

-= : نقص "قيمة معينة" من اللي موجود.

3. علامات "الحكم" (المقارنة)
== : هل الرقم ده قد ده؟

!= : هل الرقمين دول مش زي بعض؟

> / < : أكبر من و أصغر من.
  
  
  
  
  
  */
long long plus = X + Y;
long long time = X * Y;
long long minus = X - Y;
cout << X << " + " << Y << " = " << plus <<endl;
cout << X << " * " << Y << " = " << time<< endl;
cout << X << " - " << Y << " = " << minus <<endl;

  // تقدر تستغني عن تعريف المتغيرات و تشيب قبل ال اندلاين و تكتب العملية الحسابية يختصرلك 4 سطور
  
}
