// لينك السؤال : https://codeforces.com/group/MWSDmqGsZm/contest/219158/problem/D
#include<iostream>
using namespace std;
int main()
{
long long A,B,C,D; // بدل ما تعرف اربع مرات اهي في سطر واحد انجز لك 👨‍💻
cin >> A>>B>>C>>D;
long long X = ( A * B )-( C * D );
  /*
  فكرة السؤال انه يعلمك الاولويات الحسابية تحسب مين قبل مين 

  ترتيب الاولويات من الاقوي للاضعف ......

1. **الأقواس `()**`: (أي حاجة جواها تخلص الأول).
2. **المعاملات الأحادية `++ -- !**`: (زيادة، نقصان، أو نفي).
3. **الضرب والقسمة وباقي القسمة `* / %**`.
4. **الجمع والطرح `+ -**`.
5. **المقارنات `< > <= >= == !=**`.  ====  هتعرفها في لما ندخل ف الشرطية
6. **المنطق `&&` ثم `||**`. هنعرفها ف الشرطية
7. **اليساوي `=**`: (آخر خطوة لتخزين الناتج).

**قاعدة:** لو العمليات متساوية، ابدأ من **الشمال لليمين**.
  */
    cout << "Difference = " << X << endl;
}
