// لينك السؤال : https://codeforces.com/group/MWSDmqGsZm/contest/219158/problem/E
#include<iostream>
#include<iomanip>//  iomanip وتاني مكتبة نرحب بيها هي  
/*
بص يا سيدي، الكلمة دي اختصار ل 
Input/Output Manipulation ـ 
، يعني بالعربي "التحكم في شكل المدخلات والمخرجات
و هي مكتبة بنستخدمها لما نكون عايزين "نجمل" شكل الأرقام اللي بتظهر على الشاشة، مش مجرد نطلع نتيجة وخلاص  

*/
using namespace std;
int main()
{
cout << fixed << setprecision(9);
  // setprecision(9): دي وظيفتها تقول للبرنامج "يا عم الكمبيوتر، أنا عايز 9 أرقام بعد العلامة العشرية 
  // fixed: اللي في الالة  عشان تختصر العدد الكبير  e دي بقى "الشرط المكمل"، بنحطها عشان نأكد على الكمبيوتر إنه يعد الـ 9 أرقام بعد العلامة بالظبط، وميستخدمش الطريقة العلمية  لو الرقم كبر قوي اللي فيها حرف . 
double R ;
 double P= 3.141592653 ;
cin >> R;
cout <<  P*R*R;
  // ده اللي كنت اقصده في شيت الالة الحاسبة انك تكتب العملية الحسابية علطول بدل ما تقعد تعمل متغيرات و هي صح برده لكن ده انجز

}
