// لينك السؤال : https://codeforces.com/group/MWSDmqGsZm/contest/219158/problem/F
#include<iostream>
using namespace std;
int main()
{
long long  N,M;
cin >> N >> M;
cout << (N % 10 ) +( M % 10 ) << endl;
}
/*
خلينا هنا نتكلم براحة خااالص يعني ايه   
modulus % 
====================================================
تخيل معاك 13 برتقالة ومعاك 4 أصحاب.
هتبدأ توزع: كل واحد ياخد برتقالة.. التانية.. التالتة.
كده كل واحد خد 3 برتقالات (ده ناتج القسمة /)
أنت وزعت كده 12 برتقالة (3 x 4 = 12).
باقي معاك في القفص برتقالة واحدة، لو قسمتها عليهم هتضطر تقطعها (كسور)، والبرمجة مبتحبش الكسور بتحب بس العدد الصحيح 
اذن
البرتقالة اللي فضلت دي هي الموديلس: 3 % 13 = 1
احسب من الشمااااااااااااااااال !!!!!!!!
 ودي تعتبر الحالة العامة 
 هديك فكرة عن الحالات الاخري
 ===============================================================
 افتكرها ب صغير موديلس كبير هيفضل صغير
 معاك 3 برتقالات وعايز توزعهم على 10 أشخاص.
 بالعقل كده، هتعرف تدي كل واحد برتقالة كاملة؟
 لا
 يبقى مش هتوزع حاجة خالص، والـ 3 برتقالات هيفضلوا معاك في القفص زي ما هما.
 اذن
 القاعدة: 10 % 3 = 3
 


*/
