// لينك السؤال : https://codeforces.com/group/MWSDmqGsZm/contest/219158/problem/H
#include<iostream>
#include<iomanip>
#include <cmath> // ?? 
// لا تقلق == دي الكاسيو 991 اللي فيها الدوال المثلثية و اللوغارتمات و الاسية و لحل مسالتنا دي
using namespace std;
int main()
{
cout << fixed << setprecision(0);
  // بتقول للكمبيوتر "أنا عايز صفر رقم بعد العلامة العشرية".
  
double  A,B ;
cin >> A >>B;
double X = floor(A/B);
  /*
  فاهم مش حافظ 🍊 :
  floor() (الأرضية):
 ده "بخيل"، مابيعترفش بالكسور مهما كانت كبيرة
 معاك 2.9 برتقالة؟ هيقولك "أنا ماليش دعوة بالكسر، اعتبرهم 2 بس". دايماً بينزل بيك للأرض (لأصغر رقم صحيح).
  */
double Y = ceil(A/B);
  /*
ceil() (السقف):
ده "كريم جداً"، لو شاف أي كسر (حتى لو صغير) بيطلعك للسقف
  معاك 2.1 برتقالة؟ هيقولك "خلاص اعتبرهم 3". دايماً بيطلع بيك للسماء (لأكبر رقم صحيح)
  */
double Z = round(A/B);
  /*
  round() (العدل/التقريب)
  ده "قاضي"، بيبص على الكسر:
  لو الكسر أقل من 0.5 (زي 2.4): يرميه وينزل للأرض (2).
  و الكسر 0.5 أو أكتر (زي 2.5 أو 2.6): يقربك للسقف (3)
  */
cout << "floor " << A << " / "<< B << " = " << X <<endl;
cout << "ceil " << A << " / "<< B << " = " << Y <<endl;
cout << "round " << A << " / "<< B << " = " << Z <<endl;
}
