// لينك السؤال : https://codeforces.com/group/MWSDmqGsZm/contest/219158/problem/I
#include<iostream>
using namespace std;
int main()
{
int A , B;
cin >> A >> B;
  /*
   --- شرح قاعدة if...else (اتخاذ القرار) ---
   1. if (A >= B): بنسأل سؤال.. هل A أكبر من أو يساوي B؟
   2. لو الإجابة "أيوة" (True): الكمبيوتر بينفذ اللي جوه أقواس الـ if ويطبع "Yes".
   3. لو الإجابة "لأ" (False): الكمبيوتر بيطنش الـ if خالص ويروح للـ else ينفذ اللي جواها ويطبع "No".
   
   - ملحوظة: الـ else هي "الخطة ب" ومابتشتغلش غير لو شرط الـ if باظ.

   =======================================================================================================================
   فرق العلامات دي 
   \\\\\\\\\\\\\\\\\\\\\\\\\\\\
   
   = : معناها "خُد الرقم ده خليه جواك" (Assignment).

== : معناها "هل أنت بتساوي كذا؟" (سؤال).

>= : معناها "هل أنت أكبر مني أو حتى قدّي؟
*/
if (A >= B) {cout << "Yes" << endl; }
  else{cout << "No" << endl;}
 }
