// لينك السؤال : https://codeforces.com/group/MWSDmqGsZm/contest/219158/problem/M
#include <iostream>
using namespace std;
int main() {
    char X;
    cin >> X;
    if (X >= '0' && X <= '9') {
        cout << "IS DIGIT";
    } 
    else if (X >= 'A' && X <= 'Z') {
        cout << "ALPHA" << endl << "IS CAPITAL";
    } 
    else if (X >= 'a' && X <= 'z') {
        cout << "ALPHA" << endl << "IS SMALL";
    }
}
/*
تعالي افهمك ايه && و || 

فااااااااااااااااااااكر اخر درس في الفصل التامن فيزياء حديثة  تالتة ثانوي بتتكلم عن البوابات المنطقية
اهو رجعتلنا تاني اهي 
لو كنت ناسي فخد مني اللينك ده  
https://youtu.be/dqnHNPC4EgQ?si=F_eSCUzzGoh0o6Wp

يلا نشوف شكلها ف البرمجة
============================

1. الـ AND (الرمز: &&) - "القفـل"
المثال: لازم معاك (البطاقة && الكارنيه).

المنطق: لو نسيت واحد فيهم، المعيد هيقولك "نورك كفاية" ومش هتدخل. لازم الاتنين (1 و 1) عشان النتيجة تبقى (1).

\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\

2. الـ OR (الرمز: ||) - "السهالـة"
المثال: مسموح تدخل بـ (قلم جاف || قلم رصاص).

المنطق: لو معاك ده شغال، لو معاك ده شغال، لو معاك الاتنين برضه شغال. الحالة الوحيدة اللي تترفض فيها لو داخل إيدك فاضية (0 و 0).

\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\
3. الـ NOT (الرمز: !) - "العكّـاس"
المثال: مسموح بالدخول (!المشاغبين).

المنطق: لو أنت مشاغب (1)، الـ ! تخليك (0) وتطردك. هي بتدخل على الحالة تقلب كيانها، الصاحب تخليه عدو والعدو تخليه صاحب.

\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\

4. الـ XOR (الرمز: ^) - "الفـرز"
المثال: اللجنة محتاجة (مراقب واحد ^ مراقب تاني).

المنطق: لو في مراقب واحد بس موجود، اللجنة تمشي (1). لكن لو الاتنين دخلوا سوا وقعدوا يرغوا، أو مفيش حد جه خالص، اللجنة تبوظ (0). لازم "واحد بس" من الطرفين يكون موجود.

\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\
 : الزتونة
<><><><><><><><

&& : لازم كله يوافق.

|| : لو واحد وافق قشطة.

! : اقلب اللي جاي لك.

^ : لازم واحد بس اللي يوافق (ممنوع التشابه).

ولازم تكتبها فترات 
زي مثلا الارقام 
انت بتقوله لو المدخل ده اكبر من او يساوي الواحد و اصغر من او يساوي التسعة اعتبره رقم 
و هكذا 

لكن ليا كلام مهم عن الحروف افتكر في الشيتات القادمة
*/
